&НаКлиенте
Процедура История(Команда)
	
	ПараметрыФормы = ПолучитьПараметрыФормыДляОткрытия_ФормаИсторииИзмененийИсторииДанных();
	ОткрытьФорму("ФормаИсторииИзмененийИсторииДанных", ПараметрыФормы);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормыДляОткрытия_ФормаИсторииИзмененийИсторииДанных()
	
	КлючЗаписи = ПодготовитьТестовыйКлючЗаписи();
	ПараметрыФормы = Новый Структура("Данные", КлючЗаписи); 
	Возврат ПараметрыФормы;

КонецФункции

&НаСервере
Функция ПодготовитьТестовыйКлючЗаписи()
	
	ПараметрыКлючаЗаписи = новый Структура;
	ПараметрыКлючаЗаписи.Вставить("Период", Дата(2022, 7, 5));
	ПараметрыКлючаЗаписи.Вставить("Номенклатура", Справочники.Номенклатура._ТестоваяНоменклатура);
	
	КлючЗаписи = РегистрыСведений.ЦеныНоменклатуры.СоздатьКлючЗаписи(ПараметрыКлючаЗаписи);
	
	Возврат КлючЗаписи;

КонецФункции

&НаКлиенте
Процедура ИсторииВерсии(Команда)

	ПараметрыФормы = ПолучитьПараметрыФормыДляОткрытия_ФормаДанныхВерсииИсторииДанных();
	ОткрытьФорму("ФормаДанныхВерсииИсторииДанных", ПараметрыФормы);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормыДляОткрытия_ФормаДанныхВерсииИсторииДанных()
	
	КлючЗаписи = ПодготовитьТестовыйКлючЗаписи();
	ТестовыйНомер = 2;
	ПараметрыФормы = Новый Структура("Данные, НомерВерсии", КлючЗаписи, ТестовыйНомер); 
	Возврат ПараметрыФормы;

КонецФункции

&НаКлиенте
Процедура СравениеВерсий(Команда)
	
	ПараметрыФормы = ПолучитьПараметрыФормыДляОткрытия_ФормаРазличийВерсийИсторииДанных();
	ОткрытьФорму("ФормаРазличийВерсийИсторииДанных", ПараметрыФормы);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормыДляОткрытия_ФормаРазличийВерсийИсторииДанных()
	
	КлючЗаписи = ПодготовитьТестовыйКлючЗаписи();
	ТестовыйНомерДо = 2;
	ТестовыйНомерПосле = 4;
	ПараметрыФормы = Новый Структура("Данные, НомерВерсииДоИзменения, НомерВерсииПослеИзменения", 
		КлючЗаписи, ТестовыйНомерДо, ТестовыйНомерПосле); 
	Возврат ПараметрыФормы;

КонецФункции

